01-technical_support_fundamentals/04-networking.md

# Table of Contents

1.  [What is Networking?](#orgd109c16)
    1.  [Basics of Networking](#orgfd9a6da)
    2.  [Networking Hardware](#orgf824049)
    3.  [Language of the Internet](#orga71dc30)
    4.  [The Web](#org8878027)
2.  [Limitations of the Internet](#org3a59f75)
    1.  [History of the Internet](#orge302d46)
    2.  [Limitations of the Internet](#org3acfc2a)
3.  [Impact of the Internet](#orgb01fd8c)
    1.  [Impact](#org4ad2c9a)
    2.  [Internet of Things (IOT)](#orgf9ae624)
    3.  [Privacy and Security](#orgf163974)



<a id="orgd109c16"></a>

# What is Networking?


<a id="orgfd9a6da"></a>

## Basics of Networking


### Network

An interconnection of Computers.


### The Internet

The physical connection of computers and wires around the world.


### The Web

The information present on the Internet.


### Networking

In an IT field, managing, building, and designing networks.


<a id="orgf824049"></a>

## Networking Hardware

-   Ethernet Cables
-   WIFI
-   Fiber Optics
-   Router
-   ISP Network
-   Switches and Hubs


### Network Stack

A set of hardware or software that provides the infrastructure for a computer.


<a id="orga71dc30"></a>

## Language of the Internet


### IP

Delivers packets to right computers.


### TCP

Delivers information from one network to another.


<a id="org8878027"></a>

## The Web

-   URL
-   Domain Name (registered with ICANN: internet corporation for assigned names and numbers)
-   DNS


<a id="org3a59f75"></a>

# Limitations of the Internet


<a id="orge302d46"></a>

## History of the Internet

-   1960s DARPA project introduced with the earliest form of Internet called ARPANET.
-   1970s invention of TCP/IP made possible the interconnection of computers and different networks.
-   1990s was the start of World Wide Web (WWW).


<a id="org3acfc2a"></a>

## Limitations of the Internet

-   IPV4 addresses are limited, only >4 billion.
-   IPV6 addresses solve this problem with 2<sup>128</sup> addresses, but adaptation is slow and expensive.


### Network Address Translation (NAT)

Lets organization use one public IP address and many private IP addresses within the network.


<a id="orgb01fd8c"></a>

# Impact of the Internet


<a id="org4ad2c9a"></a>

## Impact


### Globalization

The movement that lets governments, businesses, and organizations communicate and integrate together on an international scale.


<a id="orgf9ae624"></a>

## Internet of Things (IOT)

Smart devices like thermostat, refrigerators, and other home appliances as well as every day smart devices which are being connected to the internet thanks to the IOT.


<a id="orgf163974"></a>

## Privacy and Security


### GDPR (General Data Protection Regulation)


### COPPA (Children Online Privacy Protection Act)


### Copyright Laws


### Open-source Licenses

